{
  "superman": "In *Superman*, the player navigates a grid, collecting green \"villains\" to unlock a jail. Destroying bandits (missiles) converts buildings into empty space. Civilians (standing/hurt/falling) interact with the environment: falling civilians harm the player, while hurt civilians trigger loss. The player wins by eliminating all bandits via the jail, but loses if any civilian is hurt. Bandits shoot missiles that destroy buildings, and the jail spawns gangs when villains are collected, rewarding their destruction for a massive score.",
  "chipschallenge": "In *Chips Challenge*, the player (avatar) navigates a grid, collecting keys, boots, and chips to unlock doors and progress. Keys open matching doors, while boots enable traversal of water/fire. Collecting chips increases score but has a limit. Water transforms to mud on collision with crates, killing the player. Doors require specific keys; failing to meet resource thresholds (e.g., missing flippers for water) results in death. The player wins by reaching the exit; losses occur via death, resource depletion, or failing door checks. Interactions include crate collisions, resource collection, and environmental hazards.",
  "shipwreck": "In *shipwreck*, the player controls a ship navigating a grid of water, land, and ports. The goal is to collect gold, gems, and diamonds from the shipwreck, then exchange them at ports to spawn treasures (t10/t5/t1) that reward points upon collection. Touching whirlpools penalizes the player. The game ends in victory if the player collects all treasures within 1000 steps or loses due to time expiration or whirlpool contact. Ports enable resource exchanges, while treasures provide incremental score boosts.",
  "islands": "In *islands*, the player controls an avatar that collects sand to create land, using a shovel to spawn sand from water or land. Fire spreads from bombs, turning water into land but killing entities. The goal is to destroy the hole (goal) by reaching it, earning 100 points for treasure. Losing occurs via avatar death from water (sand depletion), whirlpools, or being hit by fire. Sand management is critical for land creation and survival.",
  "defender": "In *Defender*, the player controls a spaceship shooting bullets (blue) and bombs (red) to destroy aliens. Aliens spawn from portals, moving left, and attack cities. Destroy all cities or survive 1000 seconds to win. Lose if the avatar is killed. Bullets kill aliens; bombs damage cities. Aliens hit by bullets or bombs both die, awarding score. Supplies replenish bullets. Aliens avoid walls and cities, with collisions causing mutual destruction.",
  "beltmanager": "In *beltmanager*, the player (avatar) manipulates levers to redirect conveyor belts (joints) and guide suitcases toward passengers. Suitcases move automatically, avoiding walls and reversing on floors. Collecting a passenger wins; losing occurs by letting suitcases reach death zones or colliding with walls. Levers transform into joints, altering belt direction to control suitcase paths. Precision in redirecting belts is key to balancing score and survival.",
  "brainman": "In *BrainMan*, the player controls an avatar navigating a maze. Collect keys (turning into missiles) to unlock doors and defeat enemies (gems) for points. Boulders bounce on contact, and walls/doors block movement. The avatar loses if killed by gems (1-5 points) or trapped. Winning requires reaching the exit (10 points). Key missiles destroy walls, while undo interactions reset objects. The game ends when the avatar dies or the exit is reached.",
  "roguelike": "The player navigates a grid, collecting weapons, gold, keys, and health to survive. Enemies (spiders, phantoms) damage the player; weapons kill them. A key unlocks a door to exit, but the player must avoid dying (health limit). The market allows trading gold for health. Win by reaching the exit; lose if health reaches zero. Key interactions: keys unlock doors, weapons are scarce and valuable, and enemies pose persistent threats.",
  "vortex": "In *vortex*, the player (avatar) navigates a grid, moving or falling through water tiles that alter their state. Water interacts with boxes, transforming them into hidden vortices that kill the player. The avatar can bounce off boxes and walls. Reaching the exit portal wins the game; dying (e.g., hitting vortices, falling water, or time running out) loses. Treasures grant points but don't affect victory. Water's orientation and color influence interactions, while hidden vortices pose lethal traps. The player must balance movement, avoid hazards, and reach the exit before time expires.",
  "boulderdash": "In *Boulderdash*, the player navigates a maze, collecting diamonds while avoiding enemies and falling boulders. The avatar can wield a sword to destroy dirt walls. Collecting 10 diamonds unlocks the exit door, but the player loses if killed by enemies, boulders, or if they exit with fewer diamonds than enemies. Enemies (crabs, butterflies) attack or transform into diamonds. Boulder collisions from above kill the player, while stepping on certain tiles triggers backsteps. Victory requires exiting with at least 9 diamonds.",
  "rivers": "In \"rivers,\" the player (avatar) uses a shovel to create holes, triggering water spread. Water destroys ground, rocks, houses, and walls, transforming dry houses into water houses (scoring 1 point each). The player loses if the avatar dies or time runs out. Win by converting all dry houses to water houses. Water spreads from sources, interacting with terrain to alter the environment and eliminate obstacles.",
  "survivezombies": "In *survivezombies*, the player controls an avatar that collects honey to gain health. Zombies (fast/slow) chase the avatar, damaging it on contact. Bees can transform zombies into honey, removing threats. The avatar can step back against walls. The player loses health from zombie collisions or dies instantly upon contact. Win by surviving 1000 steps; lose if health drops to zero or all avatars are destroyed. Zombies and bees actively pursue or interact with the player, while honey provides temporary safety.",
  "portals": "In *portals*, the player (avatar) navigates a grid, shooting bullets that behave differently (sitting, random, or directed). Portals (entry/exit pairs) enable teleportation between colored points. The goal is to destroy all green goal sprites, earning points upon contact. The player loses if all avatars are killed by bullets. Bullets reverse direction on walls or step back on collisions. Portals allow strategic movement, while structured obstacles (walls, floors) shape the environment. Victory requires eliminating all goals; defeat occurs via avatar elimination.",
  "roadfighter": "In *Roadfighter*, the player controls a yellow car navigating a highway, taking periodic damage unless fueled. Collecting fuel restores health, while colliding with cars or trees destroys them. The game ends if health reaches zero (loss) or after 500 steps (win). Dynamic portals spawn cars, trees, and fuel, creating a shifting environment. The player must balance survival and resource management against increasing threats.",
  "escape": "In \"escape,\" the player controls an avatar navigating a grid. The goal is to reach the green exit, which, when touched, triggers a win. The avatar can push boxes (colliding with walls or exits triggers a reset). Touching the blue hole instantly loses. The game ends in a timeout after 1000 steps. Key interactions: boxes bounce off avatars, walls block movement, and specific collisions (box + wall + exit) reset progress. Victory requires reaching the exit; defeat occurs via hole contact or time expiry.",
  "colourescape": "In *colourescape*, players control a color-changing avatar that transforms via switches. The goal is to reach the green exit. Avatars interact with colored boxes: matching colors bounce forward, others trigger resets. Hitting holes or walls causes loss. Time limits force a loss. Winning requires reaching the exit, while losing occurs via hole falls, time expiry, or avatar elimination. Color-based mechanics drive movement and interaction dynamics.",
  "chase": "In \"chase,\" the player (avatar) must eliminate all scared goats by touching them, converting them into carcasses (scoring points). Scared goats can be killed by carcasses, and vice versa. The player loses if killed by an angry goat. Win when all scared goats are removed. Walls block movement. Key interactions involve state-based transformations and eliminations, balancing evasion and conversion mechanics.",
  "boloadventures": "**Gameplay Summary for boloadventures:**  \nThe player controls an avatar navigating a grid, avoiding lasers and holes while pushing boxes and boulders. Boulders can transform into missiles, and lasers from cannons destroy sprites on contact. The avatar loses by being killed (via lasers or falling into holes) or stepping on the goal (which triggers a win). Winning requires reaching the goal, while losing occurs through destruction. Critical interactions include pushing objects, avoiding hazards, and managing missile transformations.",
  "labyrinthdual": "In *labyrinthdual*, two players control avatars (red/blue) navigating a maze. Red avatars cannot pass red walls; blue avatars cannot pass blue walls. Collecting redcoat/bluecoat resources transforms the avatar into the corresponding color, granting new movement abilities. The exit (green door) ends the game as a win upon contact. Traps (spikes) kill avatars, reducing score. The player loses if both avatars are eliminated or time runs out. Core mechanics revolve around navigating walls, transforming via resources, and reaching the exit while avoiding traps.",
  "crossfire": "In *crossfire*, the player (avatar) must reach a green goal while avoiding bombs and turrets. Turrets shoot bombs that damage the avatar, and bombs can destroy walls. The avatar steps back on collision with walls. Destroying the goal wins the game; losing occurs if the avatar is eliminated. Bombs also harm the avatar, and turrets retreat when hitting walls. The core challenge is navigating hazards to reach the objective. (99 words)",
  "intersection": "In \"intersection,\" the player navigates a grid, avoiding cars and obstacles to reach a green goal portal. Cars move right/down at varying speeds; collisions reduce health and teleport the player to a hidden death portal. Hitting trees/walls forces backward movement. Winning requires reaching the goal (score +10), while time runs out (1000 steps) or all avatars destroyed leads to loss. Cars wrap around edges, and the player starts at a hidden spawn point.",
  "realsokoban": "**Gameplay Summary:**  \nPlayers push boxes (represented as * and .) into holes (o) to clear levels. Boxes can be pushed into holes (scoring +1) or pulled out (scoring -1). Walls (w) block movement, forcing the avatar to step back. All boxes must be placed in holes (win) or the player loses if trapped. Boxes interact with each other and holes, with push/pull mechanics determining progress. The goal is to eliminate all boxes from the level by positioning them in holes.",
  "jaws": "In *Jaws*, the player (avatar) shoots torpedoes to eliminate fish (shark, whale, piranha), each with distinct movement patterns. Sharks chase the player, while whales and piranhas move toward them. Collecting shells (1 point) or shark fangs (1000 points) grants resources; fangs spawn if the player has enough shells. The player loses if killed by a fish or if all resources are collected. Victory occurs via resource collection or surviving the 1000-step limit. Interactions include torpedo-fish eliminations, resource collection, and conditional spawning/elimination based on shell counts.",
  "cookmepasta": "In *cookmepasta*, the player (chef) must combine ingredients to create a cooked pasta plate. Correct interactions (raw pasta + boiling water → pastainplace; tomato + tuna → sauceinplace; pastainplace + sauceinplace → plateinplace) earn points, while wrong combos (e.g., raw pasta + tuna) penalize. The chef collects a key to unlock a door, but touching the lock without the key causes loss. Winning requires forming plateinplace; losing occurs via wrongplace items or failing to unlock the door.",
  "assemblyline": "In *assemblyline*, the player controls an avatar that manipulates laser cannons via levers to guide red products through assembly stations (pink, orange, green) in sequence. Products transform through stages (potato → eyes → nose → full) at each station, earning points. The goal is to deliver the fully assembled product to the portal. Success triggers a victory sprite; failure occurs via time limit (1500 steps) or product destruction by lasers/vortex. Lasers attract products, while vortexes bounce avatars and destroy projectiles. Precision in aligning lasers and timing transformations determines victory.",
  "firestorms": "In *firestorms*, the player (avatar) navigates a maze, collecting water to gain health while avoiding fire that damages them. Fire is spawned randomly and can be extinguished by water. The goal is to reach the escape door, but touching fire or dying (via fire or wall collision) loses. Water replenishes health, and fire interacts with water and walls to vanish. The player must balance movement, resource gathering, and hazard avoidance to succeed.",
  "watergame": "In *watergame*, the player (avatar) navigates a grid, pushing boxes while avoiding water. Touching water or the door kills the avatar, resulting in loss. The door is the win condition—reaching it ends the game. Boxes can be pushed but cannot pass walls or other boxes. Water destroys both boxes and the avatar upon contact. Walls block movement, and the avatar dies on collision with water or the door. Win by reaching the door; lose by dying.",
  "deflection": "In *Deflection*, the player controls a spaceship with limited health, dodging bombs and nebulae that damage it. Turrets fire bombs that destroy the player on contact. The goal is to destroy the blackhole, which grants points upon elimination. Planets can be transformed between states, and the atmosphere gradually changes planets over time. The player loses if their health drops to zero or time runs out; they win by eliminating the blackhole.",
  "plants": "In \"plants,\" the player (avatar) shoots axes or peas to transform terrain and combat zombies. Peas convert marsh into plants, while axes destroy marsh. Zombies throw axes, harming plants. The player loses if the avatar dies; wins by destroying the goal door or surviving 1000 steps. Zombies halt at walls, and peas kill tombstones. Critical interactions involve transforming terrain, countering zombies, and protecting the avatar.",
  "avoidgeorge": "In *avoidgeorge*, the player (human) must avoid George, a chaser that hunts them. The player can be a quiet citizen, annoyed NPC, or an avatar (shootable). If George kills the avatar, the player loses. The game ends in a win if the player survives 1000 steps (timeout). Quiet citizens transform into annoyed NPCs when George interacts with them. The avatar, if shot by George, triggers a score penalty but doesn’t directly end the game. The core challenge is evading George while managing state transformations and surviving the time limit.",
  "thesnowman": "In *thesnowman*, the player assembles a snowman by placing parts (base, body, chest, head) in the correct order. Correct placements (base → body → chest → head) grant points, while incorrect placements penalize. The key is collected to unlock progress, but proximity to the lock risks losing if the key is held. Winning requires placing the head correctly (headinplace), while any wrong placement (wrongplace) causes immediate loss. The game emphasizes precise part sequencing and resource management.",
  "lasers2": "In *lasers2*, the player controls an archer avatar that shoots lasers. The goal is to reach the open door, but the avatar loses if destroyed. Lasers can be reflected by mirrors or blocked by boxes, which also bounce the player. Boulders alter laser/mirror directions, creating dynamic interactions. Walls and obstacles stop lasers, while certain collisions trigger transformations. Victory occurs when the avatar reaches the goal; defeat happens via direct laser hits or environmental hazards.",
  "witnessprotection": "In *witnessprotection*, the player (avatar) must reach an exit while avoiding a chasing witness. The witness, a red entity, pursues the player and transforms exits, risking player elimination. Bandits shoot missiles; hitting them scores points but risks player harm. The player can shoot bullets, but missiles and bullets damage them. Losing occurs if the witness reaches the exit or the player is killed. Winning requires reaching the exit without being caught, with exits changing states during gameplay.",
  "donkeykong": "In *Donkey Kong*, the player (avatar) navigates a level, shooting arrows to destroy breakable barrels (scoring points) and avoiding obstacles. The goal is to reach the green exit door, triggering a win. The player loses if their avatar is destroyed. Barrels roll, transform on contact with floors/ladders, and can be reversed by walls. The donkey, a random-moving enemy, poses a threat. Arrows kill breakable barrels, while tough ones require alternative strategies. Win by reaching the goal; lose by dying.",
  "frogs": "In \"frogs,\" the player (avatar) navigates a level to reach a green goal. Logs (brown, moving left) can be pulled or shielded from; trucks (red/orange, moving left/right) must be killed. The avatar steps back on walls and avoids collisions. Win by reaching the goal (destroying it); lose if the avatar is killed. Logs and trucks block paths, requiring strategic movement. Forests and highways spawn dynamic elements, while the player's actions determine progress.",
  "racebet": "In **racebet**, the player bets on camels by stepping on designated pits (betA-D), transforming into corresponding betting states. Camels (A-D) race toward the goal, with varying speeds. Upon reaching the goal, they become winners (winA-D). The player wins if a winner matches their bet (e.g., winA + betA), with a limit of 2 matches. Losing occurs if a winner isn’t matched. Camels and the player interact with walls and barriers, stepping back on collision. The game ends when all winners are matched or unclaimed.",
  "zenpuzzle": "In *zenpuzzle*, the player (avatar) navigates a grid, converting ground tiles to walkable ones for score, while avoiding rocks. Stepping on walkable tiles spawns flickering \"isincenter\" entities. The goal is to eliminate all ground and isincenter tiles (win), but the player loses if the avatar is destroyed. Strategic tile conversion and managing spawned entities determine success.",
  "defem": "In *defem*, the player controls an avatar that shoots bullets to eliminate enemies. Enemies include random, chasing, and directional types, spawned from various spawners. The player wins by destroying all enemies; losing occurs upon being killed. Bullets kill enemies on contact, while enemies attack the player. Enemies reverse direction or retreat when colliding with the end of their movement. The cannon allows bullet spawning, and strategic use of terrain and enemy behaviors determines success.",
  "factorymanager": "In *factorymanager*, the player controls an archer shooting boulders to manipulate lasers and boxes, guiding cars to highways (scoring 4 points) while avoiding traps. Cars crash into traps (losing), walls, or streets (scoring 1), turning into carcrash sprites. A single carcrash ends the game. The player wins by surviving 1000 steps. Lasers destroy walls/boxes, boulders transform lasers, and boxes bounce off avatars. Critical interactions involve redirecting cars, managing collisions, and preventing crashes.",
  "witnessprotected": "In *Witness Protected*, the player (avatar) must reach the exit while avoiding bandit missiles and managing health. A protector accompanies the avatar, shielding from attacks. Bandits spawn missiles in directional patterns, which can kill the avatar or protector. Switches open doors, enabling progression. The avatar can interact with environment elements to navigate. Losing occurs via health depletion or being killed by missiles; winning requires reaching the exit. The protector's gaze aligns with the avatar, enhancing defensive interactions.",
  "lemmings": "In *Lemmings*, players use a single shovel to break walls, guiding lemmings (red chasers) to exits. Lemmings autonomously move toward exits, but fall into holes (dark blue portals), dying and scoring penalties. The player loses if the shovel is destroyed or all lemmings perish. Victory occurs when all lemmings exit, clearing entrances. Walls block paths, requiring strategic shovel use to create routes. Interactions include lemmings dying on holes, walls being destroyed by the shovel, and avatars (player tools) being limited to one use.",
  "camelRace": "In *camelRace*, players control a camel navigating a grid to reach the green goal first. NPCs (random, fast, medium, slow camels) move autonomously, with varying speeds. Reaching the goal transforms the player's camel into a pink sparkle (win), while any NPC reaching it becomes a red sparkle (loss). Walls force collisions to reverse direction. The player wins by being the first to reach the goal; losing occurs if any NPC arrives first. Speed and pathfinding determine success.",
  "testgame3": "In *testgame3*, the player (avatar) navigates a grid, pushing boxes and collecting coins. Boxes bounce off walls or vanish into holes (scoring 1 point). Coins also grant 1 point upon collection. A chasing piranha kills the avatar. Switches spawn walls or destroy themselves. Win by eliminating all enemies or collecting all boxes; lose by dying or timing out. Boxes interact uniquely with walls, holes, and the player.",
  "realportals": "In *realportals*, the player (avatar) navigates a grid, collecting keys to unlock doors and using portals to teleport. They shoot missiles, switch weapons, and push boulders, which interact with walls and obstacles. The goal is to reach the green goal tile, triggering a win. Losing occurs via death (e.g., falling into water, being killed by boulders or enemies). Portals and weapon toggles enable strategic movement and combat, while keys and locks create progression hurdles.",
  "flower": "In *flower*, the player (avatar) kills progressively powerful flowers (seed → flower4) for increasing scores (0–10). Flowers auto-generate over time, and higher-tier flowers can destroy lower-tier ones. The avatar loses if killed by any flower, while surviving 1500 steps wins. Flowers behave as both obstacles and resources, with self-destructive interactions reducing their numbers. The core challenge is balancing score gain against avoiding fatal collisions.",
  "waves": "In \"waves,\" the player controls a spaceship shooting missiles (rock, sam, laser) to defeat aliens. Aliens spawn via portals and attack with lasers. Shooting aliens earns points; sam missiles convert to shields. Rock missiles damage the player, reducing shields. Losing occurs via shield depletion or enemy hits. Victory requires eliminating all aliens within 1000 steps. Critical interactions include shield regeneration from sam missiles, shield loss from rock/laser hits, and alien eliminations.",
  "cec3": "Player controls a knight, collecting coins and pushing boxes into holes (scoring 1 point each). Piranha chases and kills the avatar. Win by eliminating all boxes (via holes) or collecting them (if SpriteCounter for boxes reaches 0). Lose via death or timeout. Switch spawns walls, aiding evasion. Boxes bounce off walls and are destroyed on hole contact. Coins are collected by the avatar, providing score.",
  "x-racer": "In *x-racer*, the player controls a motorbike navigating a highway, avoiding cars, trucks, and trees that move left. Collisions reduce health, while a boost mechanic temporarily increases speed. The goal is to reach the exit portal, which spawns a victory sprite upon contact. Time limits force transformations to portals or goals. Losing occurs via health depletion or player elimination. Cars and trees actively pursue the player, with boost interactions enabling temporary speed upgrades. Victory is achieved by reaching the goal, while defeat results from collision damage or being killed by enemies.",
  "ghostbuster": "In *ghostbuster*, the player (avatar) shoots missiles to eliminate ghosts and civilians. Ghosts chase the player, while civilians either stand idle or flee. Hitting a civilian with a ghost transforms them into a fleeing state, which the player can kill for points. The player loses if all avatars die; wins by eliminating all ghosts. Civilians fleeing can also be killed, reducing their count. Walls block movement, and entities interact via collisions, with missiles destroying walls and ghosts.",
  "chopper": "In *chopper*, the player controls a helicopter (avatar) that shoots bullets and bombs to destroy enemies. Satellites (white) and tanks (blue) attack, with tanks firing missiles. The goal is to destroy all tanks and portal bases (blue tanks) to win. The avatar gains bullets by collecting supplies. Losing occurs if the avatar or satellites are destroyed. Tanks reverse direction on walls, and bombs damage tanks. Satellites penalize score upon destruction. Clouds move and can be destroyed by missiles. Win when all enemies are eliminated.",
  "run": "In \"run,\" the player controls an avatar navigating a level to reach the exit. The objective is to collect a key (singleton resource) to unlock the exit door. Avoid cliffs, which kill the player, and groundeaters that transform into damaging obstacles. The key is collected from a key sprite, but interacting with the lock without it causes the player to lose the key. Winning requires reaching the exit, while losing occurs via cliff contact or failed unlock attempts. The level's layout dictates interactions between sprites like walls, ground, and hazards.",
  "freeway": "In *freeway*, the player navigates a highway, avoiding trucks moving left/right at varying speeds. Collisions with trucks damage the player, reducing health. Hitting walls teleports the player back. The goal is to reach the green exit portal, which awards a score and ends the game. If the player's health drops to zero or time runs out (1900 steps), they lose. Trucks can wrap around the screen, and special input points spawn temporary obstacles. Victory requires reaching the exit without perishing.",
  "eggomania": "In *eggomania*, the player (avatar) uses explosive eggs to destroy enemy chickens. Chickens move at varying speeds, reverse direction on walls, and transform orientation upon collision. The avatar loses if an egg breaks (contact with wall) or time runs out. Victory occurs by eliminating all chickens or surviving the time limit. Chickens grant score upon destruction, while the avatar's ammo (explosive eggs) depletes with each shot. Walls and trunks are static obstacles. Critical interaction: eggs break on wall contact, triggering loss.",
  "deceptizelda": "In *deceptizelda*, the player (sword-wielding avatar) must destroy green (small) and gold (large) goals. Small goals require a key (obtained by interacting with a key sprite), while large goals can be destroyed with or without it. Enemies (bat, spider, scorpion) vary in speed and health; killing them grants points. The player gains a key to unlock large goals, which award higher scores. Victory occurs by destroying all goals; defeat happens if the player is killed by enemies or falls into pits. The key transforms the avatar, enabling access to high-value objectives.",
  "testgame2": "The player controls an avatar that manipulates a staff to toggle environmental states (light on/off, ok/nook) via interactions. The staff cycles through transformations based on avatar actions and time. The goal is to eliminate all \"nook\" and \"to_ok\" entities; failure to do so within 1000 time units results in loss. Walls block movement, and the avatar's timed transformations alter tile states, creating dynamic puzzle-solving challenges.",
  "enemycitadel": "In *enemycitadel*, the player (avatar) navigates a maze, avoiding pink enemies that reduce health. Crates and boulders bounce on contact, with boulders in holes triggering score gains or elimination. The goal (door) must be reached to win; touching it kills the avatar. Enemies step back from objects but attack the player. Health depletion (to 0) causes loss. Strategic use of holes and object interactions is key to survival and victory.",
  "wrapsokoban": "In *wrapsokoban*, the player (avatar) pushes boxes into holes. Boxes wrap around screen edges. Placing a box in a hole transforms it into a \"boxin\" (score +1), while moving a boxin out of a hole reverts it to a box (score -1). The player wins by eliminating all boxes (via placing them in holes). Losing conditions are unspecified, but the game ends when all boxes are in holes. Walls block movement, and the avatar bounces off boxes and walls.",
  "investdie": "In *investdie*, the player navigates a grid, collecting coins (score +1) and interacting with switches (s, k, p). Switches trigger timers and transform into inactive states, awarding points (5, 15, 10) but penalizing (−8, −22, −15) upon interaction. Walls repel the avatar, and negative scores kill it. The player wins by surviving 1500 steps or achieving a positive score; loses via timeout, avatar destruction, or negative score. Strategic switch use balances risk and reward.",
  "catapults": "In *catapults*, the player (avatar) navigates a grid, shooting directional bullets that alter environment elements. Catapults, oriented in four directions, influence the avatar's movement via gaze attraction. Bullets transform walls into movable entities, which die upon hitting water. The goal (portal) must be reached to win; touching it or being killed (e.g., by catapults or environmental hazards) causes loss. Strategic use of bullet directions and environmental interactions determines success.",
  "boulderchase": "In *boulderchase*, the player (avatar) collects diamonds while avoiding enemies (crabs, butterflies) and moving boulders. Crabs transform into diamonds on dirt, butterflies can become diamonds under specific conditions. The player loses if killed by enemies, boulders, or if they reach the exit with fewer diamonds than others. Winning requires reaching the exit door with the most diamonds, avoiding hazards, and outlasting enemies. Boulder collisions kill the player if from above, while diamonds grant score. Enemies chase the player, and some interact with terrain to create diamonds or trigger deaths.",
  "iceandfire": "In *iceandfire*, the player controls an avatar navigating a grid. Collect ice/fire boots to survive ice/fire tiles; lack of matching boots causes death. Traps and chips are static; chips grant points. The exit must be reached before time runs out. Losing occurs via death or timeout; winning requires reaching the exit. Avatar interactions with walls cause retreat, and traps/chips trigger immediate effects. Resource management and hazard avoidance are critical.",
  "waferthinmints": "In *waferthinmints*, the player (avatar) navigates a grid, collecting green wfm resources (limited to 10) while avoiding a random bomber waiter and an exit trap. Collecting more than 10 wfm instantly kills the player. The waiter can kill the avatar on contact, and touching the exit also triggers death. The player wins by surviving 1500 steps without dying. Core interactions involve resource collection, enemy avoidance, and environmental hazards. Losing occurs via over-collection, collisions, or exit contact. The game balances resource gathering with survival mechanics.",
  "decepticoins": "In *decepticoins*, the player (avatar) navigates a level, pushing boxes and collecting coins. Boxes bounce off walls or vanish into holes (scoring points). Piranhas chase the player, killing them on contact. Switches spawn walls or kill the player. Win by destroying all boxes; lose by dying to piranhas. Boxes can be bounced, but hitting walls triggers undoing moves. Coins grant points upon collection.",
  "digdug": "In *digdug*, the player (avatar) collects gems and gold while avoiding monsters. Winning requires gathering all goodies; losing occurs if all avatars die. The avatar digs with a shovel, creating boulders that transform into falling rocks, which destroy walls. Monsters shoot missiles; hitting them or walls triggers transformations. Avatars kill monsters for points but risk death. Boulder-wall collisions create resting boulders, which can be stepped on or destroyed. Critical interactions involve sprite transformations and environmental destruction.",
  "tercio": "In *tercio*, the player controls an avatar that changes color based on terrain (black/white/blue/grey). Crates bounce forward when touched; hitting a target transforms it into a winTarget, earning points. The goal is to collect all targets (win condition). Losing occurs after 1000 steps. Crates interact with walls (undoing actions) and targets. Avatar movement is restricted by terrain color rules, with step-back penalties on certain color combinations.",
  "blacksmoke": "In *blacksmoke*, the player controls an avatar that can shoot a shovel. The goal is to collect a key, unlock a lock, destroy a box, and eliminate the exit to win. The avatar loses if killed by smoke or interacting with the lock without the key. Smoke is hazardous but can be blocked by ground. The shovel destroys boxes for points, while the key unlocks the lock. Win by destroying the exit; lose by dying or failing to unlock the lock.",
  "killBillVol1": "In *killBillVol1*, the player (avatar) navigates a level, shooting enemies (varying health) with a sword to gain points. Collecting gold chips (up to 10) is critical. Traps damage the player, while lifts allow vertical movement. The goal is to reach the green door, but victory requires having the most gold at that moment; otherwise, the player loses. Enemies and traps can be toggled between visible and hidden via special tiles. Health decreases on enemy contact or trap interaction, with the player starting at 20 HP. The game ends when the goal is reached (win) or the player's health depletes (loss).",
  "hungrybirds": "In *hungrybirds*, the player controls a bird with health that depletes over time. Eating worms restores health, while a foodbank grants health and score. Walls force the bird back. Reaching the green goal door wins the game. The bird loses health from time or collisions, and dying (health ≤0) causes loss. Strategic food collection and avoiding walls are key to survival and victory.",
  "plaqueattack": "In *plaqueattack*, the player (avatar) shoots fluor missiles to shrink walls and eliminate food (hotdogs/burgers). Food items chase the player; hitting them transforms molars into dead ones, reducing score. Dead molars can be reversed by the player, gaining points. The player wins by eliminating all food and holes. Losing conditions are unclear, but core mechanics revolve around managing molar transformations, avoiding dead molars, and eliminating food sources through strategic missile use.",
  "theshepherd": "In *theshepherd*, the player (avatar) shoots treats to tame sheep. Scared sheep flee; tamed ones follow the avatar. Dogs switch between hungry (chasing treats) and helpful (assisting in taming). Sheep caught by helpful dogs become tamed, earning score. The player wins by eliminating all un-tamed sheep (notamed). Losing occurs if un-tamed sheep escape or the player fails to tame them. Treats are collected and used to transform dogs and sheep states, driving the taming mechanic.",
  "wildgunman": "In *wildgunman*, the player (avatar) shoots enemies (slow/orange, fast/yellow) and a chaser (niceGuy). Killing enemies grants points, while being hit by their bullets or the niceGuy's bullets causes loss. The player wins by eliminating all enemies via bullets, but loses if killed. Enemies spawn from portals, requiring strategic elimination before they overwhelm the player.",
  "cakybaky": "In **cakybaky**, the player (avatar) must collect ingredients in sequence (flour → milk → egg → sugar → butter → cherries) by holding prior items. The chef chases the player, killing them for a score penalty. Collecting all six ingredients wins the game. Resources are placed on floors, tables, or levels. The player loses via timeout, chef collision, or failing to collect ingredients in order. Resource collection requires holding the previous item, creating a dependency chain. The chef's movement and collision mechanics drive tension.",
  "labyrinth": "In *labyrinth*, the player navigates a maze to reach the exit. Walls block movement, traps kill the player on contact, and the exit awards a score. The player loses by dying (trap collision) or timing out; wins by reaching the exit. The avatar moves freely except when hitting walls, which force a step back. Critical interactions determine survival and victory conditions through spatial navigation and hazard avoidance.",
  "cec1": "In **cec1**, the player controls a spaceship (avatar) that shoots blue (sam) and red (bomb) missiles. Aliens (green/blue bombers) move toward the player, dropping bombs. Hitting aliens grants points, while hitting the base (planet) or missiles penalizes the player. The goal is to eliminate all aliens (via shooting or base collisions) before the avatar is destroyed. Aliens turn around on edge-of-screen (EOS), and portals spawn alien waves. Winning requires clearing all aliens, while losing occurs if the avatar dies.",
  "sokoban": "In **sokoban**, the player (avatar) pushes boxes into holes to win. Boxes bounce forward when touched and can undo moves if blocked by walls and other boxes. Holes score points when boxes land in them. Walls block movement, forcing the avatar to step back. The player loses if boxes cannot be positioned in holes, but wins when all boxes are successfully placed in holes. Critical interactions involve precise box movement and avoiding deadlocks.",
  "painter": "In *painter*, the player (avatar) converts ground tiles to paint and vice versa via resource-based interactions. Stepping on ground spawns prepaint, which, when combined with ground, converts to paint upon resource accumulation. Paint tiles can similarly be converted back to ground. The goal is to eliminate all ground tiles, triggering a win. Resource limits (prepainting/pregrounding) govern conversion rates, requiring strategic management to complete the objective. Losing conditions are unspecified, but failure to remove all ground results in a loss.",
  "zelda": "In *Zelda*, the player controls an avatar that can pick up a key to unlock a goal (door). Enemies (quick, normal, slow) attack; the sword kills them for score. The avatar loses points on enemy contact. The player wins by destroying the goal, loses if the avatar dies. Key transforms the avatar, enabling door access. Enemies avoid each other and step back from walls.",
  "sheriff": "In *sheriff*, the player controls a sheriff who shoots bullets. Bandits, which shoot missiles, roam the map. The sheriff steps back on specific tiles. Bandits transform directionally based on environmental cues. Bullets kill each other or walls; hitting a bandit scores points. The player wins by eliminating all bandits or surviving 1000 steps, loses if the sheriff is killed by a missile. Critical interactions involve bullet-missile collisions, environmental navigation, and enemy behavior.",
  "racebet2": "In *racebet2*, the player navigates a grid, transforming into a betting type (betA-D) by stepping on corresponding pits. Four camels (camelA-D) race toward the goal, transforming into win sprites upon reaching it. The player wins if their bet matches the winning camel's type and two wins occur. Loss occurs if any win sprite exists alone. Camels avoid traps and walls, with collisions causing death. The player's choice of bet determines victory conditions based on camel outcomes.",
  "waferthinmintsexit": "In *waferthinmintsexit*, the player (avatar) navigates a grid, collecting green \"wfm\" resources (score +1 each). Waiters (m) randomly attack, killing the player if they have ≥10 wfm. Collecting 11 wfm triggers a kill. Touching the exit (x) grants +2 score and ends the game. The player loses if all avatars die or time expires (1500 steps). Winning requires reaching the exit. Interactions include resource collection, combat with waiters, and exit triggering.",
  "thecitadel": "In *The Citadel*, the player navigates a maze, avoiding holes and obstacles. The avatar moves freely but steps back on contact with walls or holes. Boulders bounce off the avatar and other boulders; hitting a round hole scores 1 point, while a square hole ends the game. Crates bounce off the avatar and each other, with square holes also causing loss. Reaching the goal (door) awards 5 points and ends the game. Win by reaching the goal; lose by colliding with square holes or being hit by boulders.",
  "bomber": "In *bomber*, the player (avatar) places bombs to clear obstacles. Bombs transform into lasers or sparks upon interaction, which can destroy boxes, walls, or ignite fire. Fire spreads, damaging the avatar and altering terrain (e.g., water becomes mud). The goal is to reach the green door; failure occurs via death (from water, fire, or enemy lasers) or time expiration. Bombs and lasers interact with environment elements to progress or trigger hazards.",
  "pacman": "Pac-Man navigates a grid, collecting pellets (1 point), fruits (5 points), and power-ups (10 points). Eating power-ups temporarily turns ghosts into fleeing mode, rewarding 40 points for defeating them. Ghosts chase Pac-Man normally but retreat when powered. The player wins by consuming all food; loss occurs via ghost collision. Power-ups briefly transform ghosts, altering their behavior and enabling temporary attacks.",
  "gymkhana": "In *gymkhana*, the player (avatar) navigates a terrain using logs and platforms, avoiding walls and water. Shooting bullets transforms them into onground tiles. Catapults (immovable obstacles) reward score upon destruction. The goal (green portal) must be reached to win; touching it kills the avatar. Losing occurs via timeout or avatar death. Logs can be pulled or shielded, while landing pads and specific floor tiles enable movement. Interactions with walls and catapults alter gameplay dynamics.",
  "invest": "In \"invest,\" the player navigates a grid, collecting coins (1 point each) while avoiding hazards. Switches (s, k, p) trigger timed transformations and score changes: activating switch1 (s) adds 5 points but risks death, switch2 (k) gives 15 points with higher risk, and switch3 (p) offers 10 points. Touching walls or negative scores kills the avatar. The player must survive 1500 steps, balancing coin collection and switch management to avoid fatal penalties. Victory requires outlasting the timer; defeat occurs via timeout, death, or avatar elimination.",
  "fireman": "In *fireman*, the player (avatar) shoots water to extinguish fires, gaining score for each fire put out. Fire spreads unless blocked by water or walls. The avatar can refill water from extinguishers but takes damage from fire. If all fires are extinguished, the player wins; if the avatar's health reaches zero or time runs out, they lose. Fire can transform boxes into new flames, complicating containment.",
  "clusters": "In *clusters*, the player controls an avatar navigating a grid. Blocks (blue/red/green) can be transformed into boxes (same colors) upon collision, while boxes bounce off the avatar. Boxes can break into \"brokenBox\" when near holes. The goal is to destroy all boxes (win), but falling into holes or running out of time (1500 steps) causes loss. Transformations and undo interactions create dynamic challenges, balancing destruction and stability.",
  "pokemon": "Player controls an avatar to defeat bosses (dragon, water, thunder) using Pokémon allies with unique abilities (attack, heal, transform). Bosses deal damage and can change types. Player wins by eliminating all bosses; loses if killed or time expires (1000 steps). Pokémon abilities affect health, type, or spawn boss abilities. Boss abilities damage or transform Pokémon. Critical interactions include attacking to spawn abilities, healing allies, and countering boss attacks.",
  "sistersavior": "In *sistersavior*, the player (avatar) shoots missiles to defeat enemies (bigPop). Allies (littleSister) collect resources, aiding survival. Enemies chase the player; if they outnumber resources, they kill the player. The player wins by eliminating all enemies; loses upon death. Missiles harm enemies, while allies reward the player with resources. Enemies defeat the player if their resource count exceeds allies'. Movement is restricted by walls, and collisions trigger specific interactions.",
  "mirrors": "In *mirrors*, the player controls an archer shooting boulders that transform into colored code blocks (red, green, blue) upon hitting walls. Mirrors reverse boulder direction. Collecting three of each block type (total six) wins the game. Losing occurs if the avatar hits a cliff. Boulders can revert to original forms, and mirrors alter movement paths, requiring strategic use to accumulate all code blocks.",
  "waitforbreakfast": "In *waitforbreakfast*, the player (avatar) must sit at tables, transforming them into occupied states. A waiter chases the player, converting empty tables into workable ones. Winning requires eliminating all empty tables (via interactions), while losing occurs if the player leaves prematurely, gets caught by the waiter, or times out. Tables and chairs dictate seating positions, and the exit portal ends the game if triggered.",
  "ikaruga": "In *ikaruga*, the player controls a ship that alternates between white and black modes, firing colored bullets to destroy enemies. White bullets target white aliens, black bullets target black aliens. Bombs and changers (which switch the player's color) appear, with incorrect collisions causing loss. The player wins by eliminating all aliens and portals without being destroyed.",
  "surround": "In \"surround,\" the player controls an avatar that shoots swords to win. Dogs roam, transforming snow into mud and killing the avatar on contact. The avatar gains score by stepping on grass (from snow) but retreats on mud. The player loses if the avatar is killed or time expires. Winning requires collecting one sword, while survival and terrain management are key to avoiding dogs and environmental hazards.",
  "firecaster": "In *firecaster*, the player controls an avatar that shoots mana-powered bullets. Bullets destroy boxes, converting them into fire that spreads, damaging the avatar. Mana is a limited resource collected from the floor. The goal is to reach the green door, but fire and bullets can kill the avatar. Losing occurs upon death; winning requires reaching the goal without perishing. Walls block movement, and fire interacts with boxes and the avatar, creating hazards.",
  "cec2": "In **cec2**, the player controls an avatar that can shoot a staff, toggling its state (lighton/lightoff, ok/nook) via time-based actions. The staff's transformations affect environmental states, altering tile properties. The goal is to eliminate all 'nook' tiles while ensuring 'to_ok' tiles exist, triggering a win. The player loses if the game times out after 1000 steps. Interactions involve stepping back from walls and using the staff to manipulate tile states through timed transformations.",
  "cops": "In \"cops,\" the player (avatar) collects a key to open a jaildoor, then eliminates enemies (thugs and boss). Thugs convert into villain resources upon collision, which can spawn transactions for score gains. The boss is the final target; defeating it wins. Losing occurs via timeout or failing to eliminate the boss. The key enables progression, while resource management and strategic enemy elimination determine success.",
  "chainreaction": "In *chainreaction*, the player (avatar) must eliminate all target boulders to win. Interactions involve transforming boulders (normal → stopping → boulderm → master) via collisions with the avatar or walls, with specific rules for each state. The avatar steps back from walls, bounces off boxes, and risks losing by falling into holes (penalties) or time running out. Target boulders vanish on contact with the goal, while others trigger score penalties or elimination. Complex chain reactions determine success or failure.",
  "infection": "In *Infection*, players control an avatar (normal/carrier/infected) navigating a grid. The goal is to accumulate \"host\" entities to win. Entities transform via interactions: doctors kill viruses or convert carriers to normal, while infections spread through contact. Carriers can infect hosts, and infected entities may revert to hosts. The player loses if all hosts are eliminated or if viruses overwhelm the map. Core mechanics revolve around strategic transformation and containment.",
  "aliens": "In *aliens*, the player controls a spaceship shooting upward (blue) or downward (red) missiles. Aliens (green/blue) spawn from portals, moving toward the base. Hitting aliens scores points, but damaging the base (via missiles or aliens) causes loss. The player loses if the avatar is destroyed; wins by eliminating all aliens. Aliens reverse direction on collision, missiles vanish on EOS, and base collisions trigger destruction.",
  "lasers": "In *lasers*, the player controls an archer avatar that can shoot lasers and interact with boxes. Lasers move in directions, damaging the avatar on contact. Boxes can shield from lasers or bounce the avatar. Lasercannons can be transformed by boulders, altering their direction. The goal is a portal; reaching it awards points. The player loses if the avatar is destroyed. Critical interactions involve avoiding lasers, using boxes strategically, and manipulating lasercannons to clear paths.",
  "bait": "In *Bait*, the player controls an avatar that collects a key to unlock a goal. Mushrooms grant points, boxes can be bounced or used to destroy holes (scoring 1 point) or goals (scoring 5 points). The avatar dies upon hitting holes or being killed by boxes or keys. Winning requires destroying the goal with the key; losing occurs if the avatar is eliminated. Boxes and mushrooms interact with the environment to manipulate score and progress.",
  "bomberman": "In *bomberman*, the player controls a bomberman who places bombs to destroy walls and enemies. Bombs explode, damaging enemies and breaking walls. Enemies (bat, spider, scorpion) move randomly and can kill the player on contact. The goal is to reach the open door, which triggers a win. The player loses if killed by enemies, explosions, or falling into traps. Bombs degrade over time, and explosions spread directionally, interacting with walls and sprites to alter the environment.",
  "butterflies": "In *butterflies*, the player (avatar) collects butterflies to win, while accumulating cocoons causes loss. Butterflies can be killed by the avatar for score, but they clone when hit by cocoons. Cocoons kill butterflies on contact. Walls push the avatar back. The player must balance collecting butterflies while avoiding cocoons, as each cocoon reduces chances of victory.",
  "modality": "In *Modality*, the player controls an avatar that changes color (black/white/grey) based on terrain. The goal is to collect all target tiles by transforming onto grey tiles, which allow color shifts. Crates bounce on contact, walls block movement, and targets turn into win targets upon collection. The player wins by eliminating all targets; losing occurs if targets remain uncollected. Color-based interactions and terrain transformations drive progression.",
  "dungeon": "In \"dungeon,\" the player navigates a maze, collecting gold and a key to unlock the exit. Traps like fire, boulders, and lasers damage or kill the player. The key is required to open the exit door. The player loses if health reaches zero or they are killed by traps/enemies. Victory occurs by reaching the exit. The key unlocks the door, while gold awards points. Traps and enemies pose persistent threats, requiring careful navigation and resource management.",
  "overload": "In *overload*, the player (avatar) and NPCs collect gold, kill trees (marsh) with a limited sword, and interact with resources. The goal is to destroy the green door (goal) by collecting all gold (11 units), while avoiding being killed by NPCs. The player loses if the avatar dies, and the game ends when the door is destroyed (win) or the avatar is eliminated (loss). NPCs also collect gold and can kill the player if their gold exceeds the limit. Weapon pickups boost resources, but swords are scarce. Critical interactions involve resource management, combat, and conditional kills based on gold thresholds.",
  "garbagecollector": "In *garbagecollector*, the player navigates a grid, collecting garbage sprites to win. Hitting walls or player walls deducts score and risks loss. Garbage collection grants points; eliminating all garbage wins. The player loses if all avatars are destroyed or time runs out. Movement and collision mechanics determine success, with score tracking influencing outcomes.",
  "testgame1": "Player controls a spaceship (avatar) that shoots blue (sam) and red (bomb) missiles. Aliens (green and blue) spawn from portals, with blue appearing faster. Hitting aliens scores points, while hitting the base or certain enemies penalizes the player. The player loses if their avatar is destroyed. They win by eliminating all aliens and portals. Missiles behave differently: sam (blue) move upward, bomb (red) downward. Aliens turn around on death; missiles destroy targets on collision. Portals spawn aliens, so destroying them halts enemy waves.",
  "missilecommand": "In *MissileCommand*, the player controls a spaceship to shoot incoming missiles (slow and fast) targeting cities. Destroy all enemies to win; if any missile hits a city, the player loses. Explosions from shots can destroy enemies. Cities are protected by walls, but direct hits result in loss. The game ends when all enemies are eliminated or cities are destroyed.",
  "angelsdemons": "In *angelsdemons*, the player controls a girl navigating a maze, eliminating cursed entities. Demons and angels shoot projectiles (bolts/salvation) that damage or transform citizens into cursed (lose) or blessed (gain score). Citizens can be converted to blessed via salvation, which then destroy outputs. Walls block movement, while boxes bounce the avatar. The player wins by eliminating all cursed; loses if any remain by timeout. Missiles interact with walls, boxes, and sprites, altering scores or triggering transformations.",
  "whackamole": "In *whackamole*, the player (avatar) navigates a maze, hitting flickering moles (blue/quick or green/slow) for score while avoiding a randomly moving cat. Moles spawn from holes, and hitting them earns points. The cat can kill the avatar, causing a loss. The player wins by surviving 500 steps without being destroyed. Critical interactions: moles and cat kill the avatar (penalty), while moles grant score. The cat's movement and mole spawn rates influence difficulty.",
  "doorkoban": "In **doorkoban**, the player (avatar) pushes boxes into holes to unlock doors and reach the exit. Boxes must align with matching holes to score points and open corresponding doors. Touching walls or doors makes the player step back. The exit door, when reached, ends the game. Win by reaching the exit; lose after 1000 steps. Box-hole pairs grant escalating scores (1-8) and unlock doors, requiring strategic positioning to progress.",
  "themole": "In *themole*, the player (avatar) switches between underground and overground layers via holes, transforming entities and walls. Collect underground/overground gems to earn gold (win if all gems collected). Enemies harm the player; losing occurs when all avatars are destroyed. Movement triggers entity swaps between layers, with walls and enemies stepping back on collision. Gems grant resources, while enemy contact reduces score.",
  "seaquest": "In *Seaquest*, the player controls a submarine (avatar) that shoots torpedoes to destroy enemies like sharks, whales, and divers. Divers grant crew resources when killed, which can spawn a \"saved\" item for a high score. The avatar loses health over time but gains health by touching the sky. The game ends in victory if time runs out or all saved items are collected; defeat occurs if the avatar is destroyed by enemies or time expires. Enemies include missiles (sharks, piranas) and bombers (whales), with divers acting as resource-generating NPCs.",
  "solarfox": "In *Solar Fox*, the player controls a spaceship navigating a grid, collecting glowing gems (blib) and power-ups (powerblib) to win. Enemies shoot missiles; touching them or walls kills the player. Collecting all blib/powerblib wins. Powerblib transforms into temporary powerblibturning, which can be collected or destroyed. Enemies spawn upward/downward shots. The player loses upon death; wins by gathering all resources.",
  "eighthpassenger": "In *eighthpassenger*, the player (human) navigates a maze, transforming between standing/crouching states to interact with tunnels and doors. Aliens (pursuers/wanderers) chase or roam, with transformations triggered by player actions. The exit (green door) is the win condition: reaching it awards 10 points. Losing occurs via alien kills (-10 points) or exit destruction. The player must avoid collisions, manage state changes, and strategically open doors to progress."
}